# Things done

names2 dataframe removed 6783 filmmakers who have died and will be unable to make our movies 

will the remaining names2['primary_profession'] column match up to Manav's crew['writer'] and crew['directors'] columns ?

names2 split primary_profession to access individual professions in the lists

names2 Dropped the now-vacant death_year column

names2 df dropped birth_year col

Discovered that the values in *title2['tconst']* are the same as the values in *akas2['title_id']*

Changed *akas2['title_id']* to *akas['tconst']* to match *title2['tconst'] so we can compare overseas titles and revenue

added .gitignore to our phase-1-group-branch (ignore .ipnb)

dropped any rows outside of Ben's Box-office range of 2015 - 2018 in title2 (from 146,144; down to 67,868)

likewise dropped any rows in akas2 (to 187,981 down from 331,703) not in newly formed title2 with only Ben's years as a range

dropped names2 from 606,648 to 599,685 (6,963 filmmakers who are deceased) 

after successful dropping of any professions other than writer and director in names2 
of writer/director, names2 has 195,828 rows

Printed out a list of strings representing all unique professions under names2.primary_profession
(e.g. producer, director, writer) can add to line of code below to taylor to any of our hiring
needs and wants

## scrapped work

In [917]:
# def format_data(df):
#     for i in range(df.shape[0]):
        
#         df.iat[i,1]= df.iat[i,1].strip(" ")
# format_data(names2)
# names2.head(5)

# s = names2['primary_profession'].apply(lambda x: [z for y in x for z in y.strip(",").lower().split()])

#s = [[z for y in x for z in y.strip(",").lower().split(" ")] for x in names2['primary_profession']]

# changing values in the column from obj to str
#
#names2['primary_profession'] = names2['primary_profession'].astype('str') 
# checking that our entries are strings
#type(names2.loc[0]['primary_profession'])

# # making sure our strings are .lower()
# names2['primary_profession'] = names2['primary_profession'].apply(lambda x : x.lower())
# names2['primary_profession']

# #df[df['A'].str.contains("hello")]
# names2['primary_profession'] = names2['primary_profession'].str.contains("director")
# len(names2)

# drop the old primary_profession column filled with booleans
#names2.drop(['primary_profession'], axis=1, inplace=True)

In [918]:
# trying to get rows from one df that are not in another failure
#pd.merge(title2, akas2, on=['tconst'], how='inner')

In [919]:
# # turning the lists in names2['primary_profession'] inot lists with real life strings in them.
# def clean_alt_list(list_):
#     list_ = list_.replace(', ', '","')
#     list_ = list_.replace('[', '["')
#     list_ = list_.replace(']', '"]')
#     return list_
# names2['primary_profession'] = names2['primary_profession'].apply(clean_alt_list)

In [941]:
##inverse filtering

#value_list = ['miscellaneous', 'production_manager', 'composer', 'music_department', 'sound_department',
      #'miscellaneous', 'actor', '...', 'costume_department', 'costume_designer', 'actress', 'art_director', 'music_department' ]

##have to split the arrays first

#inverse_bool_series = ~names2.primary_profession.isin(value_list)
#names2_filtered = names2[inverse_bool_series]
#names2_filtered

In [942]:
# objective: to strip, clean and seperate names2[primary_profession]
# to find directors and writers and producers that are alive
# who make successful movies
# names2['primary_profession'] = names2['primary_profession'].str.split(",").str[:3]
# names2['primary_profession']
# (names2['primary_profession'][0])
# type(names2['primary_profession'][0][0])

In [943]:
# for index, row in names2.iterrows():
#     idx = list(len(range(names2.primary_profession)))
#     for i in idx:
#         print(row['primary_profession'][i])

In [923]:
# for i in range(len(names2)):
#     print(names2.loc[i, 'primary_profession'])

In [1109]:
# # set the words you want to match.
# matched_words = ['writer', 'writer director', 'director']
# #drop rows which has nan in column 'primary_profession'
# names2 = names2.dropna(axis='index', subset=['primary_profession'])
# #extract all matched words
# names2_extractall = names2['primary_profession'].str.extractall(rf'({"|".join(matched_words)})')
# #groupby index and join those matches result by ','
# mod_prof = names2_extractall.groupby(level=0).apply(lambda x: ",".join(x.iloc[:, 0]))
# #assign to column 'primary_profession'
# names2 = names2.assign(primary_profession=mod_prof)
# #drop no matched rows
# names2 = names2.dropna(axis='index', subset=['primary_profession'])

## End of scrapped work

In [1176]:
import pandas as pd

In [1177]:
# load Nate's imdb_dataframes (Manav has other 3 imdb dfs)

crew_imdb = pd.read_csv('imdb.title.crew.csv.gz') # manav'


# nate's 3 dfs
title_basics_imdb = pd.read_csv('imdb.title.basics.csv.gz')
akas_imdb = pd.read_csv('imdb.title.akas.csv.gz')
name_basics_imdb = pd.read_csv('imdb.name.basics.csv.gz')

# renaming the dataframes to make them easier to work with
crew = crew_imdb # manav's df

# nate's 3 dfs with cleaner names
title = title_basics_imdb
akas = akas_imdb
names = name_basics_imdb

### making copies of the dataframes for trial and error purposes

In [1178]:
# making copies of the original dfs to work on 

title2 = title.copy(deep=True)
title3 = title.copy(deep=True) # the test df for the test df...nan
akas2 = akas.copy(deep=True)
names2 = names.copy(deep=True)
crew2 = crew.copy(deep=True)

## Beginning to clean and alter the data frames

In [1179]:
# remove all directors from the names2 df that have died
names2 = names2.loc[names2['death_year'].isna()].reset_index(drop=True)

In [1180]:
# dropped the now-vacant death_year column
names2.drop(['death_year'], axis = 1, inplace=True)
# also dropping the birth_year column
names2.drop(['birth_year'], axis=1, inplace=True)

In [1181]:
# checks if first row from akas2 is in title2
#title2[title2['tconst'].str.contains("tt0401729")] ## uncomment this line to see what we're looking for
# it is so let's rename the akas2 'title_id' col to tconst for easy matching

reasigning the name of the first column in akas2 from title_id to tconst
so title2 and akas2 can be compared more readily

In [1182]:
akas2.rename(columns = {'title_id':'tconst'}, inplace = True)

In [1183]:
# getting rid of any rows outside of Ben's Box-Office dates range of 2015 - 2018
title2 = title2.loc[(title2['start_year'] >= 2015) & (title2['start_year'] <= 2018)]
#title2
# that looks good. Now let's make sure akas2 matches those years
#len(title2)

if akas2['tconst'] not in title2['tconst'] with Ben's range of years, drop those rows in skas2['tconst']
something like:  if akas2['tconst'] not in title2['tconst'] drop akas2['tconst']

In [1184]:
common = akas2.merge(title2, on=["tconst"])
akas2 = result = akas2[~akas2.tconst.isin(common.tconst)]
#len(akas2)

in the above cellthe reason that akas2 has more rows is that 
there are multiple titles in several different
languages, sharing the same tconst label. 
There are, however, no tconst in akas2 
that are not in title2 and vise versa.

steps toward achieving ***first normal form***

In [1185]:
# get rid of any professions other than writer and director or writer/director under primary_profession column
profs = names2['primary_profession'].str.split(',').explode()
filtered_profs = profs[profs.isin(['writer', 'writer director', 'director'])]
filtered_profs.groupby(filtered_profs.index).agg(','.join)
names2 = names2.drop('primary_profession', axis=1).join(filtered_profs.groupby(filtered_profs.index).agg(','.join), how='inner')

### failure at searching for highest grossin films by title

In [1227]:
films = title2['primary_title']
star_wars = films[films.isin(['Star Wars: Episode VII - The Force Awakens'])]
star_wars
title2.loc[41443, :]

tconst                                              tt2488496
primary_title      Star Wars: Episode VII - The Force Awakens
original_title     Star Wars: Episode VII - The Force Awakens
start_year                                               2015
runtime_minutes                                           136
genres                               Action,Adventure,Fantasy
Name: 41443, dtype: object

In [1237]:
# Now we have the tconst of Star Wars: Episode VII. 
# Let's find who the writer's directors were by tconst

extra_directors = names2[names2.known_for_titles.str.contains('tt2488496', na=False)].head(5)

The above list points out that just because we have primary profssion 
narrowed down to writer and director, doesn't mean that when we search for
that tconst under known_for_titles it will return only our desired director.
other actors and producers who worked on star was in that capacity are also 
directors on other projects. Thusly, there name is still associated with the
profession director/writer and returned with our search along with the 
real writer and director

**-----------------------------------------------------------------------------------------------------------------**

In [1170]:
title2.head(10)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
14,tt0170651,T.G.M. - osvoboditel,T.G.M. - osvoboditel,2018,60.0,Documentary
17,tt0192528,Heaven & Hell,Reverse Heaven,2018,104.0,Drama
22,tt0253093,Gangavataran,Gangavataran,2018,134.0,NaN
25,tt0262759,Seven Jews from My Class,Siedmiu Zydów z mojej klasy,2018,40.0,Documentary

• data descriptions •

title.basics.tsv.gz (title) - Contains the following information for titles:

tconst (string) - alphanumeric unique identifier of the title
primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release
originalTitle (string) - original title, in the original language
startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year
runtimeMinutes – primary runtime of the title, in minutes
genres (string array) – includes up to three genres associated with the title



– it appears that **title.basics** gets us the vital statistics of the movie
– the **title.basics** original_title col might match up with the **akas** title col
– might be overlap with original_title/*akas*title cols

In [1138]:
akas2.head(10)

,tconst,ordering,title,region,language,types,attributes,is_original_title
48,tt0381957,1,Cloud Cuckoo Land,GB,NaN,NaN,NaN,0.0
49,tt0401729,10,Джон Картер: Мiж двох свiтiв,UA,NaN,NaN,NaN,0.0
50,tt0401729,11,John Carter of Mars,US,NaN,working,NaN,0.0
51,tt0401729,12,A Princess of Mars,US,NaN,working,NaN,0.0
52,tt0401729,13,John Carter - Entre dos mundos,AR,NaN,imdbDisplay,NaN,0.0
53,tt0401729,14,John Carter Maaveeran,IN,ta,NaN,dubbed version,0.0
54,tt0401729,15,Džonas Karteris,LT,NaN,NaN,NaN,0.0
55,tt0401729,16,John Carter,PT,NaN,imdbDisplay,NaN,0.0
56,tt0401729,17,John Carter: Mezi dvěma světy,CZ,NaN,NaN,NaN,0.0
57,tt0401729,18,John Carter: Ανάμεσα σε δύο κόσμους,GR,NaN,NaN,NaN,0.0

• data descriptions •

title.akas.cvs.gz (akas) - Contains the following information for titles:

*titleId* (changed to *tconst* by Nate) (string) - a tconst, an alphanumeric unique identifier of the title
ordering (integer) – a number to uniquely identify rows for a given titleId
title (string) – the localized title
region (string) - the region for this version of the title
language (string) - the language of the title
types (array) - Enumerated set of attributes for this alternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning
attributes (array) - Additional terms to describe this alternative title, not enumerated
isOriginalTitle (boolean) – 0: not original title; 1: original title



– It appears that what we'll find in **akas** is the names of movies in other languages
– change is_original_title from float to int

In [1139]:
names2.head(10)

,nconst,primary_name,known_for_titles,primary_profession
2,nm0062070,Bruce Baum,"tt1470654,tt0363631,tt0104030,tt0102898",writer
5,nm0062879,Ruel S. Bayani,"tt2590280,tt0352080,tt0216559,tt2057445",director
10,nm0064023,Bryan Beasley,"tt3501180,tt1485100,tt1358897,tt1387162","director,writer"
12,nm0065847,Michael Frost Beckner,"tt0108171,tt0095953,tt0266987,tt0285332",writer
15,nm0066163,Arnaud Bedouët,"tt1355327,tt1977735,tt0173525,tt1710520","writer,director"
16,nm0066268,Steve Mitchell Beebe,"tt0827928,tt0119961,tt0408417,tt5521860",director
18,nm0067234,Hans Beimler,"tt0486657,tt0092455,tt0091129,tt0106145",writer
21,nm0068170,Dylan Bell,"tt4655766,tt3180116,tt8170168,tt4082762",director
23,nm0068874,Hava Kohav Beller,"tt0102778,tt7701650,tt0350668","director,writer"
30,nm0070482,Joel Bender,"tt1454573,tt0077597,tt4637900,tt0424938","director,writer"

• data descriptions •

name.basics.tsv.gz  (names) – Contains the following information for names:

nconst (string) - alphanumeric unique identifier of the name/person
primaryName (string)– name by which the person is most often credited
birthYear – in YYYY format
primaryProfession (array of strings)– the top-3 professions of the person
knownForTitles (array of tconsts) – titles the person is known for


nmconst = str

Here we have a list of strings representing
all the professions in primary_profession we can choose from this list and apply any names 
we wish to **"get rid of any professional except
writers and directors.. code in the cell above"**
this will return rows with only *producer*, for example.
Then we can correlate the producers with the highest 
grossing films from 2018 (or any other year) by connecting tconst
and (example) nm0001011, symbolizing director and witers, from Manav's crew df 
then secure their employment for the making of our first movies.

In [1141]:
# manav's imdb df with numbers and letters pointing to crew
crew.head(5)

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

title.crew.tsv.gz (crew) – Contains the director and writer information for all the titles in IMDb. Fields include:

tconst (string) - alphanumeric unique identifier of the title
directors (array of nconsts) - director(s) of the given title
writers (array of nconsts) – writer(s) of the given title



– the **crew** df gets us the writer and director cols
– some investigating has to be done on what the letters and numbers in each record point to (i.e. the director's name)
– ?what is tconst?

## data frames .info( )

In [1142]:
title2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 67868 entries, 2 to 146142
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   tconst           67868 non-null  object
 1   primary_title    67868 non-null  object
 2   original_title   67851 non-null  object
 3   start_year       67868 non-null  int64
 4   runtime_minutes  52445 non-null  float64
 5   genres           65031 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 3.6+ MB

drop all but North America regions?

In [1143]:
akas2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 187981 entries, 48 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   tconst             187981 non-null  object
 1   ordering           187981 non-null  int64
 2   title              187981 non-null  object
 3   region             160848 non-null  object
 4   language           24061 non-null   object
 5   types              94185 non-null   object
 6   attributes         8177 non-null    object
 7   is_original_title  187969 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 12.9+ MB

are they dead (if name in death_year, don't return name)?

In [1144]:
names2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 195828 entries, 2 to 599864
Data columns (total 4 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              195828 non-null  object
 1   primary_name        195828 non-null  object
 2   known_for_titles    189865 non-null  object
 3   primary_profession  195828 non-null  object
dtypes: object(4)
memory usage: 7.5+ MB

In [1145]:
crew2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [1146]:
crew2.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

## dataframes .describe( )

In [1147]:
title2.describe()

         start_year  runtime_minutes
count  67868.000000     52445.000000
mean    2016.515103        85.903937
std        1.106787        60.623925
min     2015.000000         1.000000
25%     2016.000000        70.000000
50%     2017.000000        87.000000
75%     2017.000000       100.000000
max     2018.000000      6017.000000

In [1148]:
akas2.describe()

            ordering  is_original_title
count  187981.000000      187969.000000
mean        5.334151           0.128159
std         6.963540           0.334268
min         1.000000           0.000000
25%         1.000000           0.000000
50%         3.000000           0.000000
75%         6.000000           0.000000
max        55.000000           1.000000

drop 6783 records of dead writers/directors

In [1149]:
names2.describe()

           nconst   primary_name known_for_titles primary_profession
count      195828         195828           189865             195828
unique     195828         190546           182472                  4
top     nm4766135  Mark Williams        tt4773466             writer
freq            1              8               43              67406

In [1150]:
crew2.describe()

           tconst  directors    writers
count      146144     140417     110261
unique     146144      98525      91920
top     tt6492958  nm3266654  nm0000636
freq            1         62         80